eisup_2019_docmng_integration/src/InformationRegisters/абс_СоответствиеДоговоровВнутрихолдинговымОперациямРЖД/абс_СоответствиеДоговоровВнутрихолдинговымОперациямРЖД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_СоответствиеДоговоровВнутрихолдинговымОперациямРЖД</name>
  <resources>
    <name>ВнутрихолдинговаяОперацияРЖД</name>
    <type>
      <types>CatalogRef.абс_ВнутрихолдинговыеОперацииРЖД</types>
    </type>
  </resources>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/абс_СоответствиеДоговоровВнутрихолдинговымОперациямРЖД/ManagerModule.bsl
Процедура ЗаписатьОперацию(ДоговорКонтрагента, Операция) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДоговорКонтрагента) Тогда 
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.абс_СоответствиеДоговоровВнутрихолдинговымОперациямРЖД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДоговорКонтрагента.Установить(ДоговорКонтрагента);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда 
		строкаНабора = НаборЗаписей[0];
		Если строкаНабора.ВнутрихолдинговаяОперацияРЖД = Операция Тогда 
			Возврат;
		КонецЕсли;
	Иначе
		строкаНабора = НаборЗаписей.Добавить();
	КонецЕсли;

	строкаНабора.ДоговорКонтрагента = ДоговорКонтрагента;
	строкаНабора.ВнутрихолдинговаяОперацияРЖД = Операция;
		
	НаборЗаписей.Записать();
	
	
КонецПроцедуры
